In [5]:
no_of_students=int(input('Enter the no of students:'))
subjects=['Tamil','English','maths','science','social']
entire_class=[]
for i in  range(1,(no_of_students+1)):
    student_info=[]
    roll_number=int(input('Enter the Roll number'))
    student_info.append(roll_number)
    total_marks=0
    for subject in subjects: 
        marks=int(input(f'Enter the FA for {subject}'))
        student_info.append(marks)
        total_marks+=marks
    student_info.append(total_marks)
    entire_class.append(student_info)
    
student_info

Enter the no of students:3
Enter the Roll number20
Enter the FA for Tamil30
Enter the FA for English40
Enter the FA for maths50
Enter the FA for science60
Enter the FA for social70
Enter the Roll number2
Enter the FA for Tamil80
Enter the FA for English70
Enter the FA for maths65
Enter the FA for science43
Enter the FA for social56
Enter the Roll number3
Enter the FA for Tamil99
Enter the FA for English20
Enter the FA for maths10
Enter the FA for science8
Enter the FA for social5

[3, 99, 20, 10, 8, 5, 142]

In [35]:
import pandas as pd
pd.options.display.max_columns = 50
df=pd.DataFrame(entire_class,columns=['Roll Number','Tamil','English','Maths','science','social','Total'])
df['Roll Number'].replace(20,1,inplace=True)
df

   Roll Number  Tamil  English  Maths  science  social  Total
0            1     30       40     50       60      70    250
1            2     80       70     65       43      56    314
2            3     99       20     10        8       5    142

In [34]:
#df["Rank"] = df["Total"].rank(ascending=0)
#df['Rank']= df["Rank"].astype('int')

In [38]:
df_sort= df.sort_values(by='Total',ascending=False)
df_sort

   Roll Number  Tamil  English  Maths  science  social  Total
1            2     80       70     65       43      56    314
0            1     30       40     50       60      70    250
2            3     99       20     10        8       5    142

In [61]:
df['check'] = df[['Tamil','English','Maths','science','social']].apply(lambda x: check_rank(x))

<class 'int'>
<class 'int'>
<class 'int'>
<class 'int'>
<class 'int'>
<class 'int'>
<class 'int'>
<class 'int'>
<class 'int'>
<class 'int'>
<class 'int'>
<class 'int'>
<class 'int'>

In [62]:
df

   Roll Number  Tamil  English  Maths  science  social  Total check
0            1     30       40     50       60      70    250   NaN
1            2     80       70     65       43      56    314   NaN
2            3     99       20     10        8       5    142   NaN

In [60]:
def check_rank(l):
    for i in l:
        print(type(i))
        if i < 40:
            return 'F'
        else:
            pass
    return 'xx'

In [30]:
marks= list(df_sort['Total'])
current_rank = 0
global_rank = 0
current_mark = 0
print(type(marks))
print(marks)
for mark in marks:
    global_rank += 1
    if mark != current_mark:
        current_mark = mark
        current_rank = global_rank
    print(current_mark, current_rank)

<class 'list'>
[314, 250, 142]
314 1
250 2
142 3